# FamilySizeTableErrorType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo..::..FamilySizeTableErrorType Property
FamilySizeTableErrorInfo Class See Also
---
The error type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FamilySizeTableErrorType FamilySizeTableErrorType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilySizeTableErrorType As FamilySizeTableErrorType
	Get
```

Visual C++
---
```text
public:
property FamilySizeTableErrorType FamilySizeTableErrorType {
	FamilySizeTableErrorType get ();
}
```

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace